//#include<stdio.h>
//int main()
//{
//	//指针遍历 二维数组
//	//定义格式一
//	int arr[3][5] =
//	{
//		{1,2,3,4,5},
//		{11,22,33,44,55},
//		{111,222,333,444,555}
//	};
//
//
//	//数组指针的数据类型：要跟数组内部元素的类型保持一致
//	//二维数组里面存储的是一维数组，一维数组里存储的是int，但是一维数组里面有5个int，所以二维数组的数据类型为int[5]
//
//	int(*p)[5] = arr;
//
//	printf("%p\n", arr);
//	printf("%p\n", arr + 1);
//
//	for (int i = 0; i < 3; i++)
//	{
//		for (int j = 0; j < 5; j++)
//		{
//			printf("%d ", *(*p + j));
//		}
//		printf("\n");
//		p++;
//	}
//
//
//	//定义格式二
//	int arr1[5] = { 0,1,2,3,4 };
//	int arr2[5] = { 1,2,3,4,5 };
//	int arr3[5] = { 5,6,7,8,9 };
//
//	//这种格式是把一维数组的指针存入二维数组
//	//所以它存放的不是数据，而是三个内存
//	int* arr4[3] = { arr1,arr2,arr3 };
//	int** q = arr4;
//
//	for (int n = 0; n < 3; n++)
//	{
//		for ( int m = 0; m < 5; m++)
//		{
//			printf("%d ", *(*q + m));
//		}
//		printf("\n");
//		q++;/*内循环遍历完第一个一维数组了，p++开始遍历第二个一维数组*/
//	}
//
//
//
//
//	return 0;
//}
