//#include<stdio.h>
//int main()
//{
//	 /*
//		二维数组
//			定义格式一：
//				m ：表示二维数组的长度
//				n ：表示每一个一维数组的长度
//				数据类型 arr[m][n] = 
//				{
//					{1,2,3,4,5,6},
//					{1,2,3,4,5,6},
//					{1,2,3,4,5,6}
//				};
//		索引遍历
//	 */
//	int arr[3][5] =
//	{
//		{1,2,3,4,5},
//		{11,22,33,44,55},
//		{111,222,333,444,555}
//	};
//
//	//arr[0]:表示二维数组当中第一个一维数组{1,2,3,4,5}}
//
//	for (int i = 0; i < 3; i++)
//	{
//		for (int j = 0; j < 5; j++)
//		{
//			//j:依次表示一维数组中的索引
//			//内循环：遍历每一个一维数组
//			printf("%d ", arr[i][j]);
//		}
//		//当内循环结束之后，表示一维数组遍历结束了
//		printf("\n");
//	}
//
//	/*
//		定义格式二：
//			核心：事先先把所有的一维数组定义完毕，再放入二维数组当中
//	*/
//	//定义三个一维数组
//	int arr1[3] = { 1,2,3 };
//	int arr2[5] = { 1,2,3,4,5 };
//	int arr3[9] = { 1,2,3,4,5,6,7,8,9 };
//
//	int len1 = sizeof(arr1) / sizeof(int);
//	int len2 = sizeof(arr2) / sizeof(int);
//	int len3 = sizeof(arr3) / sizeof(int);
//
//	int lenArr[3] = { len1,len2,len3 };
//
//	//把三个一维数组放入二维数组中
//	//数组的数据类型，跟内部存储的元素类型保持一致
//	//二维数组中存储的是三个一维数组的内存地址
//	//arr1:使用数组名进行计算的时候，退化为指向第一个元素的指针，不再表示数组的那个整体
//	//指针------内存地址   64win       8个字节
//	int* arr4[3] = { arr1,arr2,arr3 };
//
//	//利用索引遍历
//	for (int n = 0; n < 3; n++)
//	{
//		//i:依次表示二维数组的索引 0 1 2 
//		/*int len = sizeof(arr4[n]) / sizeof(int);*/
//		/*
//			sizeof（arr）不会退化，但是sizeof（arr[i]）会退化，
//			因为在这个循环中arr[]表示这个二维数组当中的第i个元素
//		*/
//		for (int m = 0; m < lenArr[n]; m++)
//		{
//			printf("%d ", arr4[n][m]);
//		}
//		printf("\n");
//	}
//
//
//	return 0;
//}